Documents/Requests/Soap_GetInvalidProducts- API M_24_02_2022_05_39_42_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vfd="http://amdocs/vfde/product/VFDEGetInvalidProducts" xmlns:vfd1="http://amdocs/vfde/product/VFDEGetInvalidProductsInput">
  <soapenv:Header />
  <soapenv:Body>
    <vfd:GetInvalidProductsRequest>
      <vfd1:ROOT>
        <Event>
          <Type>GetInvalidProducts</Type>
          <ID>saurav1234</ID>
        </Event>
        <DATA>
          <AddressId>1591979</AddressId>
          <ProductCodes>4KP</ProductCodes>
        </DATA>
      </vfd1:ROOT>
    </vfd:GetInvalidProductsRequest>
  </soapenv:Body>
</soapenv:Envelope>